In [3]:
import pandas as pd

In [5]:
#create empty dataframe
df = pd.DataFrame()

#create a column
df['name'] = ['Damian', 'Sarah', 'Ray']
df['employed'] = ['Yes', 'Yes', 'No']
df['age'] = [32,29,19]

#view datafram
df

     name employed  age
0  Damian      Yes   32
1   Sarah      Yes   29
2     Ray       No   19

In [8]:
#create a function
def mean_age_by_group(dataframe,col):
    #groups the data by a column and return the mean age per group
    return dataframe.groupby(col).mean()

In [9]:
#create a function
def uppercase_column_name(dataframe):
    #cap all the column headers
    dataframe.columns = dataframe.columns.str.upper()
    #return dataframe
    return dataframe

In [11]:
#create a pipeline that applied both functions
(df.pipe(mean_age_by_group,col='employed')
    #then apply the uppercase function
    .pipe(uppercase_column_name)
)

           AGE
employed
No        19.0
Yes       30.5